# constant value
LABEL_LIST = ['期待', '仇恨', '悲伤', '惊奇', '焦虑', '快乐', '爱', '愤怒']
RAW_LABEL_LIST = ['Expect', 'Hate', 'Sorrow', 'Surprise', 'Anxiety', 'Joy', 'Love', 'Anger']

RELATION_GRAPH = [[0, 0, 0, 0, 1, 1, 1, 0],
                  [0, 0, 1, 0, 1, 0, 0, 1],
                  [0, 1, 0, 1, 1, 0, 0, 1],
                  [0, 0, 1, 0, 1, 1, 1, 0],
                  [1, 1, 1, 1, 0, 0, 0, 1],
                  [1, 0, 0, 1, 0, 0, 1, 0],
                  [1, 0, 0, 1, 0, 1, 0, 0],
                  [0, 1, 1, 0, 1, 0, 0, 0]]
